//Готельна справа нелегка штука. Особливо в наші часи. Grand Mate Hotel оновив свій сайт для бронювання номерів. Нарешті крім номера телефону готелю з'явилася і форма для бронювання. У формі бронювання потрібно ввести кількість гостей. На жаль, програмісти зробили це поле текстовим і тепер готель отримує результати у вигляді "1 гість", "3", "Я і моя мала", "Двійко гостей", "Десь 6". Давай покращимо програмне забезпечення готелю і швидко напишемо для них першу версію функції getGuestsCount, яка прийматиме рядок guestsInput і повертатиме кількість гостей, тільки якщо число стоїть на початку рядка. В інших випадках повертай рядок not a number. Приклади:

function getGuestsCount(guestsInput) {
  if (Object.is(parseInt(guestsInput), NaN) === true) {
    return "not a number";
  }
  return parseInt(guestsInput);
}

getGuestsCount("Двоє");
// === 'not a number'
getGuestsCount("Я буду 1");
// === 'not a number'
getGuestsCount("3 людини");
// === 3

getGuestsCount("12 людини");
